#include <iostream>
using namespace std;

void arrb(float *a,int n) //a Ч масив д≥йсних чисел (через вказ≥вник) n Ч його розм≥р.
{
    int m=0; //ѕеретворюЇмо a[i] у int, тобто обр≥заЇмо дробову частину.
    for(int i=0;i<n;i++) //якщо ц≥ле значенн€ парне Ч рахуЇмо.

	{
        if(int(a[i])%2==0)
            m++;
    }
    float *b = new float [m]; //створюЇтьс€ динам≥чний масив b дл€ збереженн€ парних елемент≥в.
    int ind=0;
    for(int i=0;i<n;i++)
	{
        if(int(a[i])%2==0) //парн≥ елементи з a коп≥юютьс€ в b.
		{
            b[ind]=a[i];
            ind++;
        }
    }
    for(int i=0;i<m;i++) //це сортуванн€ вибором або бульбашкове сортуванн€ (вар≥ант), €ке розставл€Ї елементи за зростанн€м.
	{
        for(int j=i+1;j<m;j++)
		{
            if(b[i]>b[j])
            swap(b[i],b[j]);
        }
    }
    for(int i=0;i<m;i++) //вивод€тьс€ вс≥ парн≥ елементи (вже в≥дсортован≥).

	{
        cout<<b[i]<<" ";
    }

    delete [] b;
}
int main()
{
    int n; //«читуЇтьс€ розм≥р масиву n.
    cout<<"Enter n for first array:"; 
    cin>>n; //¬вод€тьс€ n чисел.

    float *a = new float[n];
   
    for(int i=0;i<n;i++)
	{
        cin>>a[i]; //¬ид≥л€Їтьс€ памТ€ть п≥д масив a.
    }
    arrb(a,n); //¬икликаЇтьс€ функц≥€ arrb() дл€ обробки масиву.
    delete[] a; //«в≥льн€Їтьс€ памТ€ть.


    return 0;
}
